# Brewfile

# Install command-line tools using Homebrew.

# Tap sources
# ================
tap "phinze/cask"
tap "homebrew/cask-fonts"


# Install formulas
# ================
# install cask forumlas:
# install custom powerline fonts for dev and terminal
cask "font-menlo-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-powerline-symbols"
cask "font-fira-code"

cask "hyper"
cask "google-chrome"
cask "visual-studio-code"
cask "slack"
cask "spectacle"

# install brew forumlas
brew "git-flow"
brew "git"
brew "watchman"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-completions"